# Degree Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
NurbSpline..::..Degree Property
NurbSpline Class See Also
---
Returns the degree of the nurb spline.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public int Degree { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Degree As Integer
	Get
```

Visual C++
---
```text
public:
property int Degree {
	int get ();
}
```

# See Also
NurbSpline Class
Autodesk.Revit.DB Namespace